Revit 2027 API
BuiltInFailures.GroupFailures.GroupPropagationFailedSketch Property
 Can't change Group"[Name]" with more than one instance because it has a Sketch-based element. Edit the Sketch of the element instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GroupPropagationFailedSketch { get; }
Public Shared ReadOnly Property GroupPropagationFailedSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GroupPropagationFailedSketch {
	FailureDefinitionId^ get ();
}
static member GroupPropagationFailedSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace